public class Main {
    public static void main(String[] args) {
        System.out.println("Домашняя работ №4 Циклы");
        //Задание 1
        //С помощью цикла for выведите в консоль все числа от 1 до 10.
        for (int i = 1; i < 10; i++) ;
        {
            System.out.print(i + "Число = ");
        }
    }
    }